ka2_2024/src/Enums/ВидыЛьготПоИмущественнымНалогам/ВидыЛьготПоИмущественнымНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛьготПоИмущественнымНалогам</name>
  <enumValues>
    <name>Освобождение</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСтавкиНаПроцент</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСтавкиДоУказанной</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСуммыНаПроцент</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСуммыНаСумму</name>
  </enumValues>
  <enumValues>
    <name>СнижениеНалоговойБазыНаСумму</name>
  </enumValues>
  <enumValues>
    <name>ДоляНеоблагаемойПлощади</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ОснованияЛьготПоИмущественнымНалогам/ОснованияЛьготПоИмущественнымНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОснованияЛьготПоИмущественнымНалогам</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Налог</name>
    <type>
      <types>EnumRef.ВидыИмущественныхНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленаМестнымНормативнымАктом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛьготы</name>
    <type>
      <types>EnumRef.ВидыЛьготПоИмущественнымНалогам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНормативногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНормативногоАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеМестнойЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентУменьшения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальноеОбразование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГдеУстановлена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ЛьготыПоИмущественнымНалогамПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Данные о льготах по имущественным налогам.
// 
// Параметры:
//  Налог - ПеречислениеСсылка.ВидыИмущественныхНалогов
//  ВключатьНеактуальные - Булево - если Истина, то будут включены данные о льготах, которых нет в действующей редакции НК
// 
// Возвращаемое значение:
//  Структура - Данные о льготах по имущественным налогам:
// * ЕстьНеактуальные - Булево - Истина, если по налогу применялись льготы по НК, которых нет в действующей редакции НК
// * ФедеральныеЛьготы - Соответствие - ключ - код льготы, значение - описание льготы п нормативным документам
// * МестныеЛьготы - Соответствие - ключ - вид льготы (Перечисления.ВидыЛьготПоИмущественнымНалогам),
//					значение - описание льготы п нормативным документам
Функция ДанныеОЛьготахПоИмущественнымНалогам(Налог, ВключатьНеактуальные = Истина) Экспорт 

	Результат = Новый Структура;
	
	ФедеральныеЛьготы = Новый Соответствие;
	
	ИмяМакетаКлассификатора = "КлассификаторЛьгот_" + ОбщегоНазначения.ИмяЗначенияПеречисления(Налог);
	
	Попытка
		МакетЛьгот = Справочники.ОснованияЛьготПоИмущественнымНалогам.ПолучитьМакет(ИмяМакетаКлассификатора);
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru='Не найден макет классификатора льгот ""%1""'"), ИмяМакетаКлассификатора);
	КонецПопытки;
	
	ОбластьМакета = МакетЛьгот.ПолучитьОбласть("ФедеральныеЛьготы"); // есть в макетах для всех налогов
	КоличествоЛьгот = ОбластьМакета.ВысотаТаблицы;
	
	Результат.Вставить("ЕстьНеактуальные", Ложь);
	
	// Актуальные льготы
	Для НомерСтроки = 1 По КоличествоЛьгот Цикл
		
		КодЛьготы = СокрЛП(ОбластьМакета.Область(НомерСтроки, 1).Текст);
		
		ОписаниеЛьготы = Новый Структура;
		
		ОписаниеЛьготы.Вставить("Наименование", ОбластьМакета.Область(НомерСтроки, 2).Текст);
		ОписаниеЛьготы.Вставить("Категория", ОбластьМакета.Область(НомерСтроки, 3).Текст);
		ОписаниеЛьготы.Вставить("Основание", ОбластьМакета.Область(НомерСтроки, 4).Текст);
		
		ВидЛьготыСтрокой = ОбластьМакета.Область(НомерСтроки, 5).Текст;
		ОписаниеЛьготы.Вставить("ВидЛьготы", Перечисления.ВидыЛьготПоИмущественнымНалогам[ВидЛьготыСтрокой]);
		ОписаниеЛьготы.Вставить("ПроцентЛьготы", 0);
		Если ОписаниеЛьготы.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСтавкиНаПроцент
			 Или ОписаниеЛьготы.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСуммыНаПроцент Тогда
			ПроцентЛьготы = ОбластьМакета.Область(НомерСтроки, 6).Текст;
			ОписаниеЛьготы.Вставить("ПроцентЛьготы", ?(ЗначениеЗаполнено(ПроцентЛьготы), Число(ПроцентЛьготы), 0));
		КонецЕсли;
		ОписаниеЛьготы.Вставить("Актуальная", Истина);
		
		ФедеральныеЛьготы.Вставить(КодЛьготы, ОписаниеЛьготы);
		
	КонецЦикла;
	
	// Неактуальные льготы - для обратной совместимости. Для некоторых налогов область может отсутствовать.
	Результат.Вставить("ЕстьНеактуальные", Истина);
	Если МакетЛьгот.Области.Найти("ФедеральныеЛьготы_Неактуальные") = Неопределено Тогда
		Результат.Вставить("ЕстьНеактуальные", Ложь);	
	ИначеЕсли ВключатьНеактуальные Тогда
		ОбластьМакета = МакетЛьгот.ПолучитьОбласть("ФедеральныеЛьготы_Неактуальные");	
		КоличествоЛьгот = ОбластьМакета.ВысотаТаблицы;
		Для НомерСтроки = 1 По КоличествоЛьгот Цикл
			
			КодЛьготы = СокрЛП(ОбластьМакета.Область(НомерСтроки, 1).Текст);
			
			ОписаниеЛьготы = Новый Структура;
			
			ОписаниеЛьготы.Вставить("Наименование", ОбластьМакета.Область(НомерСтроки, 2).Текст);
			ОписаниеЛьготы.Вставить("Категория", ОбластьМакета.Область(НомерСтроки, 3).Текст);
			ОписаниеЛьготы.Вставить("Основание", ОбластьМакета.Область(НомерСтроки, 4).Текст);
			
			ВидЛьготыСтрокой = ОбластьМакета.Область(НомерСтроки, 5).Текст;
			ОписаниеЛьготы.Вставить("ВидЛьготы", Перечисления.ВидыЛьготПоИмущественнымНалогам[ВидЛьготыСтрокой]);
			ПроцентЛьготы = ОбластьМакета.Область(НомерСтроки, 6).Текст;
			ОписаниеЛьготы.Вставить("ПроцентЛьготы", ?(ЗначениеЗаполнено(ПроцентЛьготы), Число(ПроцентЛьготы), 0));
			ОписаниеЛьготы.Вставить("Актуальная", Ложь);
			
			ФедеральныеЛьготы.Вставить(КодЛьготы, ОписаниеЛьготы);
			
		КонецЦикла;
	КонецЕсли;	
	
	Результат.Вставить("ФедеральныеЛьготы", ФедеральныеЛьготы);
	
	МестныеЛьготы = Новый Соответствие;
	ОбластьМакета = МакетЛьгот.ПолучитьОбласть("МестныеЛьготы");	
	КоличествоЛьгот = ОбластьМакета.ВысотаТаблицы;
	
	// Для региональных льгот больше информации несет вид льготы - по нему можно однозначно определить код льготы
	Для НомерСтроки = 1 По КоличествоЛьгот Цикл
		
		ВидЛьготыСтрокой = ОбластьМакета.Область(НомерСтроки, 4).Текст;
		ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам[ВидЛьготыСтрокой];
				
		ОписаниеЛьготы = Новый Структура;
		
		ОписаниеЛьготы.Вставить("КодЛьготы", ОбластьМакета.Область(НомерСтроки, 1).Текст);
		ОписаниеЛьготы.Вставить("Наименование", ОбластьМакета.Область(НомерСтроки, 2).Текст);
		ОписаниеЛьготы.Вставить("Категория", ОбластьМакета.Область(НомерСтроки, 3).Текст);
		
		МестныеЛьготы.Вставить(ВидЛьготы, ОписаниеЛьготы);
		
	КонецЦикла;
	
	Результат.Вставить("МестныеЛьготы", МестныеЛьготы);
	
	Возврат Результат;
	
КонецФункции
 
#КонецОбласти
